In [1]:
# import pandas as pd

data = {"Name":["john","pitter","lisa"],
       "Age":[21,23,22],
       "Salary":[300000,45000,25000]}
df = pd.DataFrame(data)
print(df)

     Name  Age  Salary
0    john   21  300000
1  pitter   23   45000
2    lisa   22   25000

In [3]:
import pandas as pd

data = pd.read_csv("C:/Users/HP/OneDrive - gnindia.dronacharya.info/Desktop/Numpy Jupyter/bookings.csv")
print(data)

               hotel market_segment deposit_type  lead_time  \
0       Resort Hotel         Direct   No Deposit        342
1       Resort Hotel         Direct   No Deposit        737
2       Resort Hotel         Direct   No Deposit          7
3       Resort Hotel      Corporate   No Deposit         13
4       Resort Hotel      Online TA   No Deposit         14
...              ...            ...          ...        ...
119385    City Hotel  Offline TA/TO   No Deposit         23
119386    City Hotel      Online TA   No Deposit        102
119387    City Hotel      Online TA   No Deposit         34
119388    City Hotel      Online TA   No Deposit        109
119389    City Hotel      Online TA   No Deposit        205

        previous_cancellations  previous_bookings_not_canceled  \
0                            0                               0
1                            0                               0
2                            0                               0
3                            0                               0
4                            0                               0
...                        ...                             ...
119385                       0                               0
119386                       0                               0
119387                       0                               0
119388                       0                               0
119389                       0                               0

        days_in_waiting_list  booking_changes  total_of_special_requests  \
0                          0                3                          0
1                          0                4                          0
2                          0                0                          0
3                          0                0                          0
4                          0                0                          1
...                      ...              ...                        ...
119385                     0                0                          0
119386                     0                0                          2
119387                     0                0                          4
119388                     0                0                          0
119389                     0                0                          2

        is_canceled
0                 0
1                 0
2                 0
3                 0
4                 0
...             ...
119385            0
119386            0
119387            0
119388            0
119389            0

[119390 rows x 10 columns]

In [9]:
data = pd.read_excel("C:/Users/HP/OneDrive - gnindia.dronacharya.info/Desktop/Numpy Jupyter/bookingsnew.xlsx")
print(data)

               hotel market_segment deposit_type  lead_time  \
0       Resort Hotel         Direct   No Deposit        342
1       Resort Hotel         Direct   No Deposit        737
2       Resort Hotel         Direct   No Deposit          7
3       Resort Hotel      Corporate   No Deposit         13
4       Resort Hotel      Online TA   No Deposit         14
...              ...            ...          ...        ...
119385    City Hotel  Offline TA/TO   No Deposit         23
119386    City Hotel      Online TA   No Deposit        102
119387    City Hotel      Online TA   No Deposit         34
119388    City Hotel      Online TA   No Deposit        109
119389    City Hotel      Online TA   No Deposit        205

        previous_cancellations  previous_bookings_not_canceled  \
0                            0                               0
1                            0                               0
2                            0                               0
3                            0                               0
4                            0                               0
...                        ...                             ...
119385                       0                               0
119386                       0                               0
119387                       0                               0
119388                       0                               0
119389                       0                               0

        days_in_waiting_list  booking_changes  total_of_special_requests  \
0                          0                3                          0
1                          0                4                          0
2                          0                0                          0
3                          0                0                          0
4                          0                0                          1
...                      ...              ...                        ...
119385                     0                0                          0
119386                     0                0                          2
119387                     0                0                          4
119388                     0                0                          0
119389                     0                0                          2

        is_canceled
0                 0
1                 0
2                 0
3                 0
4                 0
...             ...
119385            0
119386            0
119387            0
119388            0
119389            0

[119390 rows x 10 columns]

In [19]:
# Exploring Data in pandas

data = pd.read_excel("C:/Users/HP/OneDrive - gnindia.dronacharya.info/Desktop/Numpy Jupyter/bookingsnew.xlsx")
# print(data)
print(data.head(10))
print(data.tail(10))

print(data.head())
print(data.tail())# by default gives fives values

          hotel market_segment deposit_type  lead_time  \
0  Resort Hotel         Direct   No Deposit        342
1  Resort Hotel         Direct   No Deposit        737
2  Resort Hotel         Direct   No Deposit          7
3  Resort Hotel      Corporate   No Deposit         13
4  Resort Hotel      Online TA   No Deposit         14
5  Resort Hotel      Online TA   No Deposit         14
6  Resort Hotel         Direct   No Deposit          0
7  Resort Hotel         Direct   No Deposit          9
8  Resort Hotel      Online TA   No Deposit         85
9  Resort Hotel  Offline TA/TO   No Deposit         75

   previous_cancellations  previous_bookings_not_canceled  \
0                       0                               0
1                       0                               0
2                       0                               0
3                       0                               0
4                       0                               0
5                       0                               0
6                       0                               0
7                       0                               0
8                       0                               0
9                       0                               0

   days_in_waiting_list  booking_changes  total_of_special_requests  \
0                     0                3                          0
1                     0                4                          0
2                     0                0                          0
3                     0                0                          0
4                     0                0                          1
5                     0                0                          1
6                     0                0                          0
7                     0                0                          1
8                     0                0                          1
9                     0                0                          0

   is_canceled
0            0
1            0
2            0
3            0
4            0
5            0
6            0
7            0
8            1
9            1
             hotel market_segment deposit_type  lead_time  \
119380  City Hotel      Online TA   No Deposit         44
119381  City Hotel         Direct   No Deposit        188
119382  City Hotel      Online TA   No Deposit        135
119383  City Hotel  Offline TA/TO   No Deposit        164
119384  City Hotel  Offline TA/TO   No Deposit         21
119385  City Hotel  Offline TA/TO   No Deposit         23
119386  City Hotel      Online TA   No Deposit        102
119387  City Hotel      Online TA   No Deposit         34
119388  City Hotel      Online TA   No Deposit        109
119389  City Hotel      Online TA   No Deposit        205

        previous_cancellations  previous_bookings_not_canceled  \
119380                       0                               0
119381                       0                               0
119382                       0                               0
119383                       0                               0
119384                       0                               0
119385                       0                               0
119386                       0                               0
119387                       0                               0
119388                       0                               0
119389                       0                               0

        days_in_waiting_list  booking_changes  total_of_special_requests  \
119380                     0                0                          1
119381                     0                0                          0
119382                     0                0                          0
119383                     0                0                          0
119384                     0                0                          2
119385                     0                0                          0
119386                     0                0                          2
119387                     0                0                          4
119388                     0                0                          0
119389                     0                0                          2

        is_canceled
119380            0
119381            0
119382            0
119383            0
119384            0
119385            0
119386            0
119387            0
119388            0
119389            0
          hotel market_segment deposit_type  lead_time  \
0  Resort Hotel         Direct   No Deposit        342
1  Resort Hotel         Direct   No Deposit        737
2  Resort Hotel         Direct   No Deposit          7
3  Resort Hotel      Corporate   No Deposit         13
4  Resort Hotel      Online TA   No Deposit         14

   previous_cancellations  previous_bookings_not_canceled  \
0                       0                               0
1                       0                               0
2                       0                               0
3                       0                               0
4                       0                               0

   days_in_waiting_list  booking_changes  total_of_special_requests  \
0                     0                3                          0
1                     0                4                          0
2                     0                0                          0
3                     0                0                          0
4                     0                0                          1

   is_canceled
0            0
1            0
2            0
3            0
4            0
             hotel market_segment deposit_type  lead_time  \
119385  City Hotel  Offline TA/TO   No Deposit         23
119386  City Hotel      Online TA   No Deposit        102
119387  City Hotel      Online TA   No Deposit         34
119388  City Hotel      Online TA   No Deposit        109
119389  City Hotel      Online TA   No Deposit        205

        previous_cancellations  previous_bookings_not_canceled  \
119385                       0                               0
119386                       0                               0
119387                       0                               0
119388                       0                               0
119389                       0                               0

        days_in_waiting_list  booking_changes  total_of_special_requests  \
119385                     0                0                          0
119386                     0                0                          2
119387                     0                0                          4
119388                     0                0                          0
119389                     0                0                          2

        is_canceled
119385            0
119386            0
119387            0
119388            0
119389            0

In [21]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119390 entries, 0 to 119389
Data columns (total 10 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   hotel                           119390 non-null  object
 1   market_segment                  119390 non-null  object
 2   deposit_type                    119390 non-null  object
 3   lead_time                       119390 non-null  int64
 4   previous_cancellations          119390 non-null  int64
 5   previous_bookings_not_canceled  119390 non-null  int64
 6   days_in_waiting_list            119390 non-null  int64
 7   booking_changes                 119390 non-null  int64
 8   total_of_special_requests       119390 non-null  int64
 9   is_canceled                     119390 non-null  int64
dtypes: int64(7), object(3)
memory usage: 9.1+ MB
None

In [22]:
data.describe()

,lead_time,previous_cancellations,previous_bookings_not_canceled,days_in_waiting_list,booking_changes,total_of_special_requests,is_canceled
count,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000
mean,104.011416,0.087118,0.137097,2.321149,0.221124,0.571363,0.370416
std,106.863097,0.844336,1.497437,17.594721,0.652306,0.792798,0.482918
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,18.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,69.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,160.000000,0.000000,0.000000,0.000000,0.000000,1.000000,1.000000
max,737.000000,26.000000,72.000000,391.000000,21.000000,5.000000,1.000000

In [23]:
print(data.isnull())

        hotel  market_segment  deposit_type  lead_time  \
0       False           False         False      False
1       False           False         False      False
2       False           False         False      False
3       False           False         False      False
4       False           False         False      False
...       ...             ...           ...        ...
119385  False           False         False      False
119386  False           False         False      False
119387  False           False         False      False
119388  False           False         False      False
119389  False           False         False      False

        previous_cancellations  previous_bookings_not_canceled  \
0                        False                           False
1                        False                           False
2                        False                           False
3                        False                           False
4                        False                           False
...                        ...                             ...
119385                   False                           False
119386                   False                           False
119387                   False                           False
119388                   False                           False
119389                   False                           False

        days_in_waiting_list  booking_changes  total_of_special_requests  \
0                      False            False                      False
1                      False            False                      False
2                      False            False                      False
3                      False            False                      False
4                      False            False                      False
...                      ...              ...                        ...
119385                 False            False                      False
119386                 False            False                      False
119387                 False            False                      False
119388                 False            False                      False
119389                 False            False                      False

        is_canceled
0             False
1             False
2             False
3             False
4             False
...             ...
119385        False
119386        False
119387        False
119388        False
119389        False

[119390 rows x 10 columns]

In [24]:
print(data.isnull().sum())

hotel                             0
market_segment                    0
deposit_type                      0
lead_time                         0
previous_cancellations            0
previous_bookings_not_canceled    0
days_in_waiting_list              0
booking_changes                   0
total_of_special_requests         0
is_canceled                       0
dtype: int64

In [27]:
# handling Duplicate values in pandas
data = pd.read_excel("C:/Users/HP/OneDrive - gnindia.dronacharya.info/Desktop/Numpy Jupyter/bookingsnew.xlsx")
print(data)

               hotel market_segment deposit_type  lead_time  \
0       Resort Hotel         Direct   No Deposit        342
1       Resort Hotel         Direct   No Deposit        737
2       Resort Hotel         Direct   No Deposit          7
3       Resort Hotel      Corporate   No Deposit         13
4       Resort Hotel      Online TA   No Deposit         14
...              ...            ...          ...        ...
119385    City Hotel  Offline TA/TO   No Deposit         23
119386    City Hotel      Online TA   No Deposit        102
119387    City Hotel      Online TA   No Deposit         34
119388    City Hotel      Online TA   No Deposit        109
119389    City Hotel      Online TA   No Deposit        205

        previous_cancellations  previous_bookings_not_canceled  \
0                            0                               0
1                            0                               0
2                            0                               0
3                            0                               0
4                            0                               0
...                        ...                             ...
119385                       0                               0
119386                       0                               0
119387                       0                               0
119388                       0                               0
119389                       0                               0

        days_in_waiting_list  booking_changes  total_of_special_requests  \
0                          0                3                          0
1                          0                4                          0
2                          0                0                          0
3                          0                0                          0
4                          0                0                          1
...                      ...              ...                        ...
119385                     0                0                          0
119386                     0                0                          2
119387                     0                0                          4
119388                     0                0                          0
119389                     0                0                          2

        is_canceled
0                 0
1                 0
2                 0
3                 0
4                 0
...             ...
119385            0
119386            0
119387            0
119388            0
119389            0

[119390 rows x 10 columns]

In [26]:
print(data.duplicated()) # find duplicates of only unique variable

0         False
1         False
2         False
3         False
4         False
          ...
119385     True
119386     True
119387    False
119388     True
119389     True
Length: 119390, dtype: bool

In [28]:
print(data["hotel"].duplicated())

0         False
1          True
2          True
3          True
4          True
          ...
119385     True
119386     True
119387     True
119388     True
119389     True
Name: hotel, Length: 119390, dtype: bool

In [35]:
print(data["hotel"].duplicated().sum())

119388

In [33]:
print(data.drop_duplicates("hotel"))

              hotel market_segment deposit_type  lead_time  \
0      Resort Hotel         Direct   No Deposit        342
40060    City Hotel  Offline TA/TO   No Deposit          6

       previous_cancellations  previous_bookings_not_canceled  \
0                           0                               0
40060                       0                               0

       days_in_waiting_list  booking_changes  total_of_special_requests  \
0                         0                3                          0
40060                     0                0                          0

       is_canceled
0                0
40060            0

In [5]:
import pandas as pd
data = pd.read_csv("Dataset .csv")
print(data)

      Restaurant ID           Restaurant Name  Country Code              City  \
0           6317637          Le Petit Souffle           162       Makati City
1           6304287          Izakaya Kikufuji           162       Makati City
2           6300002    Heat - Edsa Shangri-La           162  Mandaluyong City
3           6318506                      Ooma           162  Mandaluyong City
4           6314302               Sambo Kojin           162  Mandaluyong City
...             ...                       ...           ...               ...
9546        5915730               Naml۱ Gurme           208         ��stanbul
9547        5908749              Ceviz A��ac۱           208         ��stanbul
9548        5915807                     Huqqa           208         ��stanbul
9549        5916112               A���k Kahve           208         ��stanbul
9550        5927402  Walter's Coffee Roastery           208         ��stanbul

                                                Address  \
0     Third Floor, Century City Mall, Kalayaan Avenu...
1     Little Tokyo, 2277 Chino Roces Avenue, Legaspi...
2     Edsa Shangri-La, 1 Garden Way, Ortigas, Mandal...
3     Third Floor, Mega Fashion Hall, SM Megamall, O...
4     Third Floor, Mega Atrium, SM Megamall, Ortigas...
...                                                 ...
9546  Kemanke�� Karamustafa Pa��a Mahallesi, R۱ht۱m ...
9547  Ko��uyolu Mahallesi, Muhittin ��st�_nda�� Cadd...
9548  Kuru�_e��me Mahallesi, Muallim Naci Caddesi, N...
9549  Kuru�_e��me Mahallesi, Muallim Naci Caddesi, N...
9550  Cafea��a Mahallesi, Bademalt۱ Sokak, No 21/B, ...

                                        Locality  \
0      Century City Mall, Poblacion, Makati City
1     Little Tokyo, Legaspi Village, Makati City
2     Edsa Shangri-La, Ortigas, Mandaluyong City
3         SM Megamall, Ortigas, Mandaluyong City
4         SM Megamall, Ortigas, Mandaluyong City
...                                          ...
9546                                    Karak�_y
9547                                   Ko��uyolu
9548                                 Kuru�_e��me
9549                                 Kuru�_e��me
9550                                        Moda

                                       Locality Verbose   Longitude  \
0     Century City Mall, Poblacion, Makati City, Mak...  121.027535
1     Little Tokyo, Legaspi Village, Makati City, Ma...  121.014101
2     Edsa Shangri-La, Ortigas, Mandaluyong City, Ma...  121.056831
3     SM Megamall, Ortigas, Mandaluyong City, Mandal...  121.056475
4     SM Megamall, Ortigas, Mandaluyong City, Mandal...  121.057508
...                                                 ...         ...
9546                                Karak�_y, ��stanbul   28.977392
9547                               Ko��uyolu, ��stanbul   29.041297
9548                             Kuru�_e��me, ��stanbul   29.034640
9549                             Kuru�_e��me, ��stanbul   29.036019
9550                                    Moda, ��stanbul   29.026016

       Latitude                          Cuisines  ...          Currency  \
0     14.565443        French, Japanese, Desserts  ...  Botswana Pula(P)
1     14.553708                          Japanese  ...  Botswana Pula(P)
2     14.581404  Seafood, Asian, Filipino, Indian  ...  Botswana Pula(P)
3     14.585318                   Japanese, Sushi  ...  Botswana Pula(P)
4     14.584450                  Japanese, Korean  ...  Botswana Pula(P)
...         ...                               ...  ...               ...
9546  41.022793                           Turkish  ...  Turkish Lira(TL)
9547  41.009847   World Cuisine, Patisserie, Cafe  ...  Turkish Lira(TL)
9548  41.055817            Italian, World Cuisine  ...  Turkish Lira(TL)
9549  41.057979                   Restaurant Cafe  ...  Turkish Lira(TL)
9550  40.984776                              Cafe  ...  Turkish Lira(TL)

     Has Table booking Has Online delivery Is delivering now  \
0                  Yes                  No                No
1                  Yes                  No                No
2                  Yes                  No                No
3                   No                  No                No
4                  Yes                  No                No
...                ...                 ...               ...
9546                No                  No                No
9547                No                  No                No
9548                No                  No                No
9549                No                  No                No
9550                No                  No                No

     Switch to order menu Price range  Aggregate rating  Rating color  \
0                      No           3               4.8    Dark Green
1                      No           3               4.5    Dark Green
2                      No           4               4.4         Green
3                      No           4               4.9    Dark Green
4                      No           4               4.8    Dark Green
...                   ...         ...               ...           ...
9546                   No           3               4.1         Green
9547                   No           3               4.2         Green
9548                   No           4               3.7        Yellow
9549                   No           4               4.0         Green
9550                   No           2               4.0         Green

     Rating text Votes
0      Excellent   314
1      Excellent   591
2      Very Good   270
3      Excellent   365
4      Excellent   229
...          ...   ...
9546   Very Good   788
9547   Very Good  1034
9548        Good   661
9549   Very Good   901
9550   Very Good   591

[9551 rows x 21 columns]

In [3]:
print(data.isnull().sum())

hotel                             0
market_segment                    0
deposit_type                      0
lead_time                         0
previous_cancellations            0
previous_bookings_not_canceled    0
days_in_waiting_list              0
booking_changes                   0
total_of_special_requests         0
is_canceled                       0
dtype: int64

In [6]:
print(data.isnull().sum())

Restaurant ID           0
Restaurant Name         0
Country Code            0
City                    0
Address                 0
Locality                0
Locality Verbose        0
Longitude               0
Latitude                0
Cuisines                9
Average Cost for two    0
Currency                0
Has Table booking       0
Has Online delivery     0
Is delivering now       0
Switch to order menu    0
Price range             0
Aggregate rating        0
Rating color            0
Rating text             0
Votes                   0
dtype: int64

In [8]:
data = pd.read_csv("nullvalue.csv")
print(data)

                DateTime  AUD/JPY (open)  AUD/JPY (high)  AUD/JPY (low)  \
0    2015-02-05 00:00:00             NaN             NaN            NaN
1    2015-02-06 00:00:00             NaN             NaN            NaN
2    2015-02-09 00:00:00             NaN             NaN            NaN
3    2015-02-10 00:00:00             NaN             NaN            NaN
4    2015-02-11 00:00:00             NaN             NaN            NaN
..                   ...             ...             ...            ...
255  2016-02-01 00:00:00          85.779          86.219         85.297
256  2016-02-02 00:00:00          85.899          86.163         84.086
257  2016-02-03 00:00:00          84.205          84.774         83.200
258  2016-02-04 00:00:00          84.572          85.060         83.914
259  2016-02-05 00:00:00          84.121          84.121         84.121

     AUD/JPY (close)  Navigator
0                NaN     91.003
1                NaN     91.668
2                NaN     92.333
3                NaN     92.442
4                NaN     92.907
..               ...        ...
255           85.897     85.779
256           84.204     85.899
257           84.571     84.205
258           84.122     84.572
259           84.121     84.121

[260 rows x 6 columns]

In [10]:
print(data.isnull().sum())

DateTime             0
AUD/JPY (open)     160
AUD/JPY (high)     160
AUD/JPY (low)      160
AUD/JPY (close)    160
Navigator            0
dtype: int64

In [11]:
print(data.dropna())

                DateTime  AUD/JPY (open)  AUD/JPY (high)  AUD/JPY (low)  \
160  2015-09-17 00:00:00          86.781          87.515         85.853
161  2015-09-18 00:00:00          86.316          86.868         85.797
162  2015-09-21 00:00:00          86.278          86.382         85.719
163  2015-09-22 00:00:00          85.885          86.120         84.636
164  2015-09-23 00:00:00          84.960          85.210         84.007
..                   ...             ...             ...            ...
255  2016-02-01 00:00:00          85.779          86.219         85.297
256  2016-02-02 00:00:00          85.899          86.163         84.086
257  2016-02-03 00:00:00          84.205          84.774         83.200
258  2016-02-04 00:00:00          84.572          85.060         83.914
259  2016-02-05 00:00:00          84.121          84.121         84.121

     AUD/JPY (close)  Navigator
160           86.317     86.781
161           86.235     86.316
162           85.885     86.278
163           84.959     85.885
164           84.130     84.960
..               ...        ...
255           85.897     85.779
256           84.204     85.899
257           84.571     84.205
258           84.122     84.572
259           84.121     84.121

[100 rows x 6 columns]

In [12]:
print(data)

                DateTime  AUD/JPY (open)  AUD/JPY (high)  AUD/JPY (low)  \
0    2015-02-05 00:00:00             NaN             NaN            NaN
1    2015-02-06 00:00:00             NaN             NaN            NaN
2    2015-02-09 00:00:00             NaN             NaN            NaN
3    2015-02-10 00:00:00             NaN             NaN            NaN
4    2015-02-11 00:00:00             NaN             NaN            NaN
..                   ...             ...             ...            ...
255  2016-02-01 00:00:00          85.779          86.219         85.297
256  2016-02-02 00:00:00          85.899          86.163         84.086
257  2016-02-03 00:00:00          84.205          84.774         83.200
258  2016-02-04 00:00:00          84.572          85.060         83.914
259  2016-02-05 00:00:00          84.121          84.121         84.121

     AUD/JPY (close)  Navigator
0                NaN     91.003
1                NaN     91.668
2                NaN     92.333
3                NaN     92.442
4                NaN     92.907
..               ...        ...
255           85.897     85.779
256           84.204     85.899
257           84.571     84.205
258           84.122     84.572
259           84.121     84.121

[260 rows x 6 columns]

In [13]:
import numpy as np
print(data.replace(np.nan,"hi"))

                DateTime AUD/JPY (open) AUD/JPY (high) AUD/JPY (low)  \
0    2015-02-05 00:00:00             hi             hi            hi
1    2015-02-06 00:00:00             hi             hi            hi
2    2015-02-09 00:00:00             hi             hi            hi
3    2015-02-10 00:00:00             hi             hi            hi
4    2015-02-11 00:00:00             hi             hi            hi
..                   ...            ...            ...           ...
255  2016-02-01 00:00:00         85.779         86.219        85.297
256  2016-02-02 00:00:00         85.899         86.163        84.086
257  2016-02-03 00:00:00         84.205         84.774          83.2
258  2016-02-04 00:00:00         84.572          85.06        83.914
259  2016-02-05 00:00:00         84.121         84.121        84.121

    AUD/JPY (close)  Navigator
0                hi     91.003
1                hi     91.668
2                hi     92.333
3                hi     92.442
4                hi     92.907
..              ...        ...
255          85.897     85.779
256          84.204     85.899
257          84.571     84.205
258          84.122     84.572
259          84.121     84.121

[260 rows x 6 columns]

In [15]:
data["AUD/JPY (high)"] = data["AUD/JPY (high)"].replace(np.nan,90)
print(data)

                DateTime  AUD/JPY (open)  AUD/JPY (high)  AUD/JPY (low)  \
0    2015-02-05 00:00:00             NaN          90.000            NaN
1    2015-02-06 00:00:00             NaN          90.000            NaN
2    2015-02-09 00:00:00             NaN          90.000            NaN
3    2015-02-10 00:00:00             NaN          90.000            NaN
4    2015-02-11 00:00:00             NaN          90.000            NaN
..                   ...             ...             ...            ...
255  2016-02-01 00:00:00          85.779          86.219         85.297
256  2016-02-02 00:00:00          85.899          86.163         84.086
257  2016-02-03 00:00:00          84.205          84.774         83.200
258  2016-02-04 00:00:00          84.572          85.060         83.914
259  2016-02-05 00:00:00          84.121          84.121         84.121

     AUD/JPY (close)  Navigator
0                NaN     91.003
1                NaN     91.668
2                NaN     92.333
3                NaN     92.442
4                NaN     92.907
..               ...        ...
255           85.897     85.779
256           84.204     85.899
257           84.571     84.205
258           84.122     84.572
259           84.121     84.121

[260 rows x 6 columns]

In [16]:
print(data)

                DateTime  AUD/JPY (open)  AUD/JPY (high)  AUD/JPY (low)  \
0    2015-02-05 00:00:00             NaN          90.000            NaN
1    2015-02-06 00:00:00             NaN          90.000            NaN
2    2015-02-09 00:00:00             NaN          90.000            NaN
3    2015-02-10 00:00:00             NaN          90.000            NaN
4    2015-02-11 00:00:00             NaN          90.000            NaN
..                   ...             ...             ...            ...
255  2016-02-01 00:00:00          85.779          86.219         85.297
256  2016-02-02 00:00:00          85.899          86.163         84.086
257  2016-02-03 00:00:00          84.205          84.774         83.200
258  2016-02-04 00:00:00          84.572          85.060         83.914
259  2016-02-05 00:00:00          84.121          84.121         84.121

     AUD/JPY (close)  Navigator
0                NaN     91.003
1                NaN     91.668
2                NaN     92.333
3                NaN     92.442
4                NaN     92.907
..               ...        ...
255           85.897     85.779
256           84.204     85.899
257           84.571     84.205
258           84.122     84.572
259           84.121     84.121

[260 rows x 6 columns]

In [17]:
data = pd.read_csv("nullvalue.csv")
print(data)

                DateTime  AUD/JPY (open)  AUD/JPY (high)  AUD/JPY (low)  \
0    2015-02-05 00:00:00             NaN             NaN            NaN
1    2015-02-06 00:00:00             NaN             NaN            NaN
2    2015-02-09 00:00:00             NaN             NaN            NaN
3    2015-02-10 00:00:00             NaN             NaN            NaN
4    2015-02-11 00:00:00             NaN             NaN            NaN
..                   ...             ...             ...            ...
255  2016-02-01 00:00:00          85.779          86.219         85.297
256  2016-02-02 00:00:00          85.899          86.163         84.086
257  2016-02-03 00:00:00          84.205          84.774         83.200
258  2016-02-04 00:00:00          84.572          85.060         83.914
259  2016-02-05 00:00:00          84.121          84.121         84.121

     AUD/JPY (close)  Navigator
0                NaN     91.003
1                NaN     91.668
2                NaN     92.333
3                NaN     92.442
4                NaN     92.907
..               ...        ...
255           85.897     85.779
256           84.204     85.899
257           84.571     84.205
258           84.122     84.572
259           84.121     84.121

[260 rows x 6 columns]

In [18]:
print(data["AUD/JPY (high)"].mean())

86.71850999999998

In [19]:
data["AUD/JPY (high)"]= data["AUD/JPY (high)"].replace(np.nan,86.718)
print(data)

                DateTime  AUD/JPY (open)  AUD/JPY (high)  AUD/JPY (low)  \
0    2015-02-05 00:00:00             NaN          86.718            NaN
1    2015-02-06 00:00:00             NaN          86.718            NaN
2    2015-02-09 00:00:00             NaN          86.718            NaN
3    2015-02-10 00:00:00             NaN          86.718            NaN
4    2015-02-11 00:00:00             NaN          86.718            NaN
..                   ...             ...             ...            ...
255  2016-02-01 00:00:00          85.779          86.219         85.297
256  2016-02-02 00:00:00          85.899          86.163         84.086
257  2016-02-03 00:00:00          84.205          84.774         83.200
258  2016-02-04 00:00:00          84.572          85.060         83.914
259  2016-02-05 00:00:00          84.121          84.121         84.121

     AUD/JPY (close)  Navigator
0                NaN     91.003
1                NaN     91.668
2                NaN     92.333
3                NaN     92.442
4                NaN     92.907
..               ...        ...
255           85.897     85.779
256           84.204     85.899
257           84.571     84.205
258           84.122     84.572
259           84.121     84.121

[260 rows x 6 columns]

In [20]:
print(data["AUD/JPY (high)"].mean())

86.71819615384615

In [21]:
data = pd.read_csv("nullvalue.csv")
print(data)

                DateTime  AUD/JPY (open)  AUD/JPY (high)  AUD/JPY (low)  \
0    2015-02-05 00:00:00             NaN             NaN            NaN
1    2015-02-06 00:00:00             NaN             NaN            NaN
2    2015-02-09 00:00:00             NaN             NaN            NaN
3    2015-02-10 00:00:00             NaN             NaN            NaN
4    2015-02-11 00:00:00             NaN             NaN            NaN
..                   ...             ...             ...            ...
255  2016-02-01 00:00:00          85.779          86.219         85.297
256  2016-02-02 00:00:00          85.899          86.163         84.086
257  2016-02-03 00:00:00          84.205          84.774         83.200
258  2016-02-04 00:00:00          84.572          85.060         83.914
259  2016-02-05 00:00:00          84.121          84.121         84.121

     AUD/JPY (close)  Navigator
0                NaN     91.003
1                NaN     91.668
2                NaN     92.333
3                NaN     92.442
4                NaN     92.907
..               ...        ...
255           85.897     85.779
256           84.204     85.899
257           84.571     84.205
258           84.122     84.572
259           84.121     84.121

[260 rows x 6 columns]

In [22]:
print(data.fillna(method = "bfill"))

                DateTime  AUD/JPY (open)  AUD/JPY (high)  AUD/JPY (low)  \
0    2015-02-05 00:00:00          86.781          87.515         85.853
1    2015-02-06 00:00:00          86.781          87.515         85.853
2    2015-02-09 00:00:00          86.781          87.515         85.853
3    2015-02-10 00:00:00          86.781          87.515         85.853
4    2015-02-11 00:00:00          86.781          87.515         85.853
..                   ...             ...             ...            ...
255  2016-02-01 00:00:00          85.779          86.219         85.297
256  2016-02-02 00:00:00          85.899          86.163         84.086
257  2016-02-03 00:00:00          84.205          84.774         83.200
258  2016-02-04 00:00:00          84.572          85.060         83.914
259  2016-02-05 00:00:00          84.121          84.121         84.121

     AUD/JPY (close)  Navigator
0             86.317     91.003
1             86.317     91.668
2             86.317     92.333
3             86.317     92.442
4             86.317     92.907
..               ...        ...
255           85.897     85.779
256           84.204     85.899
257           84.571     84.205
258           84.122     84.572
259           84.121     84.121

[260 rows x 6 columns]

C:\Users\HP\AppData\Local\Temp\ipykernel_20068\2754045057.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "bfill"))

In [24]:
print(data.fillna(method = "ffill"))

                DateTime  AUD/JPY (open)  AUD/JPY (high)  AUD/JPY (low)  \
0    2015-02-05 00:00:00             NaN             NaN            NaN
1    2015-02-06 00:00:00             NaN             NaN            NaN
2    2015-02-09 00:00:00             NaN             NaN            NaN
3    2015-02-10 00:00:00             NaN             NaN            NaN
4    2015-02-11 00:00:00             NaN             NaN            NaN
..                   ...             ...             ...            ...
255  2016-02-01 00:00:00          85.779          86.219         85.297
256  2016-02-02 00:00:00          85.899          86.163         84.086
257  2016-02-03 00:00:00          84.205          84.774         83.200
258  2016-02-04 00:00:00          84.572          85.060         83.914
259  2016-02-05 00:00:00          84.121          84.121         84.121

     AUD/JPY (close)  Navigator
0                NaN     91.003
1                NaN     91.668
2                NaN     92.333
3                NaN     92.442
4                NaN     92.907
..               ...        ...
255           85.897     85.779
256           84.204     85.899
257           84.571     84.205
258           84.122     84.572
259           84.121     84.121

[260 rows x 6 columns]

C:\Users\HP\AppData\Local\Temp\ipykernel_20068\1391920301.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "ffill"))

In [25]:
print(data.fillna("non"))

                DateTime AUD/JPY (open) AUD/JPY (high) AUD/JPY (low)  \
0    2015-02-05 00:00:00            non            non           non
1    2015-02-06 00:00:00            non            non           non
2    2015-02-09 00:00:00            non            non           non
3    2015-02-10 00:00:00            non            non           non
4    2015-02-11 00:00:00            non            non           non
..                   ...            ...            ...           ...
255  2016-02-01 00:00:00         85.779         86.219        85.297
256  2016-02-02 00:00:00         85.899         86.163        84.086
257  2016-02-03 00:00:00         84.205         84.774          83.2
258  2016-02-04 00:00:00         84.572          85.06        83.914
259  2016-02-05 00:00:00         84.121         84.121        84.121

    AUD/JPY (close)  Navigator
0               non     91.003
1               non     91.668
2               non     92.333
3               non     92.442
4               non     92.907
..              ...        ...
255          85.897     85.779
256          84.204     85.899
257          84.571     84.205
258          84.122     84.572
259          84.121     84.121

[260 rows x 6 columns]

In [ ]:
# columns Transformation in pandas

In [1]:
import pandas as pd
df = pd.read_csv("bonus.csv")
print(df)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]

In [3]:
df = pd.read_csv("bonus.csv")
df.loc[(df["Bonus %"]== 0),"GetsBonus"] = "NO Bonus"
df.loc[(df["Bonus %"]> 0),"GetsBonus"] = "Bonus"
print(df.head(10))

  First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0    Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1     Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2      Maria  Female   4/23/1993        11:17 AM  130590   11.858
3      Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4      Larry    Male   1/24/1998         4:47 PM  101004    1.389
5     Dennis    Male   4/18/1987         1:35 AM  115163   10.125
6       Ruby  Female   8/17/1987         4:20 PM   65476   10.012
7        NaN  Female   7/20/2015        10:43 AM   45906   11.598
8     Angela  Female  11/22/2005         6:29 AM   95570   18.523
9    Frances  Female    8/8/2002         6:51 AM  139852    7.524

  Senior Management                  Team GetsBonus
0              True             Marketing     Bonus
1              True                   NaN     Bonus
2             False               Finance     Bonus
3              True               Finance     Bonus
4              True       Client Services     Bonus
5             False                 Legal     Bonus
6              True               Product     Bonus
7               NaN               Finance     Bonus
8              True           Engineering     Bonus
9              True  Business Development     Bonus

In [8]:
data = pd.read_csv("employee_data.csv")
print(data)

data["Full Name"] = data["FirstName"]+ " "+data["LastName"]
print(data.head(10))

      EmpID FirstName    LastName  StartDate   ExitDate  \
0      3427     Uriah     Bridges  20-Sep-19        NaN
1      3428     Paula       Small  11-Feb-23        NaN
2      3429    Edward        Buck  10-Dec-18        NaN
3      3430   Michael     Riordan  21-Jun-21        NaN
4      3431   Jasmine       Onque  29-Jun-19        NaN
...     ...       ...         ...        ...        ...
2995   3422    Jakobe    Erickson  22-Jun-22  07-Aug-22
2996   3423    Adyson  Strickland  28-Dec-20        NaN
2997   3424   Annabel     Wilkins  09-Dec-20  04-Aug-22
2998   3425    Kendra       Braun  28-May-19  23-Oct-21
2999   3426     Chace        Kerr  27-Apr-22        NaN

                        Title          Supervisor  \
0     Production Technician I        Peter Oneill
1     Production Technician I     Renee Mccormick
2          Area Sales Manager      Crystal Walker
3          Area Sales Manager      Rebekah Wright
4          Area Sales Manager           Jason Kim
...                       ...                 ...
2995  Production Technician I      Bethany Carter
2996  Production Technician I     Caroline Harris
2997  Production Technician I  Mr. James Castillo
2998  Production Technician I       Michael Woods
2999  Production Technician I       Javier Mccall

                              ADEmail BusinessUnit          EmployeeStatus  \
0         uriah.bridges@bilearner.com         CCDR                  Active
1           paula.small@bilearner.com           EW                  Active
2           edward.buck@bilearner.com           PL                  Active
3       michael.riordan@bilearner.com         CCDR                  Active
4         jasmine.onque@bilearner.com          TNS                  Active
...                               ...          ...                     ...
2995    jakobe.erickson@bilearner.com          PYZ        Leave of Absence
2996  adyson.strickland@bilearner.com          SVG                  Active
2997    annabel.wilkins@bilearner.com          TNS  Voluntarily Terminated
2998       kendra.braun@bilearner.com          WBL  Voluntarily Terminated
2999         chace.kerr@bilearner.com          BPC                  Active

      ...               Division         DOB State JobFunctionDescription  \
0     ...   Finance & Accounting  07-10-1969    MA             Accounting
1     ...                 Aerial  30-08-1965    MA                  Labor
2     ...          General - Sga  06-10-1991    MA              Assistant
3     ...   Finance & Accounting  04-04-1998    ND                  Clerk
4     ...          General - Con  29-08-1969    FL                Laborer
...   ...                    ...         ...   ...                    ...
2995  ...              Engineers  23-06-1998    MA        Model Assistant
2996  ...              Engineers  10-06-2001    MA               Engineer
2997  ...  Wireline Construction  27-01-1997    MA                Laborer
2998  ...                 Aerial  28-05-1954    MA                Foreman
2999  ...       Field Operations  11-09-1990    MA   Warehouse Technician

     GenderCode LocationCode  RaceDesc MaritalDesc Performance Score  \
0        Female        34904     White     Widowed       Fully Meets
1          Male         6593  Hispanic     Widowed       Fully Meets
2          Male         2330  Hispanic     Widowed       Fully Meets
3          Male        58782     Other      Single       Fully Meets
4        Female        33174     Other     Married       Fully Meets
...         ...          ...       ...         ...               ...
2995     Female        44500     Other     Widowed       Fully Meets
2996       Male        35444     Black     Widowed       Fully Meets
2997       Male         6608     White      Single       Fully Meets
2998     Female         3807  Hispanic    Divorced       Fully Meets
2999     Female        57487     White     Married       Fully Meets

     Current Employee Rating
0                          4
1                          3
2                          4
3                          2
4                          3
...                      ...
2995                       3
2996                       3
2997                       2
2998                       2
2999                       2

[3000 rows x 26 columns]
   EmpID FirstName  LastName  StartDate   ExitDate                    Title  \
0   3427     Uriah   Bridges  20-Sep-19        NaN  Production Technician I
1   3428     Paula     Small  11-Feb-23        NaN  Production Technician I
2   3429    Edward      Buck  10-Dec-18        NaN       Area Sales Manager
3   3430   Michael   Riordan  21-Jun-21        NaN       Area Sales Manager
4   3431   Jasmine     Onque  29-Jun-19        NaN       Area Sales Manager
5   3432     Maruk    Fraval  17-Jan-20        NaN       Area Sales Manager
6   3433     Latia     Costa  06-Apr-22  03-Jul-23       Area Sales Manager
7   3434  Sharlene     Terry  06-Nov-20  29-Jan-23       Area Sales Manager
8   3435       Jac  McKinzie  18-Aug-18        NaN       Area Sales Manager
9   3436    Joseph   Martins  21-Jan-22  29-Jun-23       Area Sales Manager

        Supervisor                        ADEmail BusinessUnit EmployeeStatus  \
0     Peter Oneill    uriah.bridges@bilearner.com         CCDR         Active
1  Renee Mccormick      paula.small@bilearner.com           EW         Active
2   Crystal Walker      edward.buck@bilearner.com           PL         Active
3   Rebekah Wright  michael.riordan@bilearner.com         CCDR         Active
4        Jason Kim    jasmine.onque@bilearner.com          TNS         Active
5     Sheri Campos     maruk.fraval@bilearner.com          BPC         Active
6      Jacob Braun      latia.costa@bilearner.com          WBL         Active
7    Tracy Marquez   sharlene.terry@bilearner.com         CCDR         Active
8    Sharon Becker     jac.mckinzie@bilearner.com          NEL         Active
9   George Jenkins   joseph.martins@bilearner.com          BPC         Active

   ...         DOB State JobFunctionDescription GenderCode LocationCode  \
0  ...  07-10-1969    MA             Accounting     Female        34904
1  ...  30-08-1965    MA                  Labor       Male         6593
2  ...  06-10-1991    MA              Assistant       Male         2330
3  ...  04-04-1998    ND                  Clerk       Male        58782
4  ...  29-08-1969    FL                Laborer     Female        33174
5  ...  03-04-1949    CT                 Driver       Male         6050
6  ...  01-07-1942    CA             Technician     Female        90007
7  ...  07-03-1957    OR               Engineer     Female        97756
8  ...  15-05-1974    TX    Executive Assistant       Male        78789
9  ...  11-11-1949    TX               Engineer       Male        78207

   RaceDesc MaritalDesc Performance Score Current Employee Rating  \
0     White     Widowed       Fully Meets                       4
1  Hispanic     Widowed       Fully Meets                       3
2  Hispanic     Widowed       Fully Meets                       4
3     Other      Single       Fully Meets                       2
4     Other     Married       Fully Meets                       3
5     Black     Married       Fully Meets                       3
6  Hispanic    Divorced           Exceeds                       4
7     White    Divorced       Fully Meets                       2
8     Black     Widowed           Exceeds                       3
9     Asian     Widowed       Fully Meets                       5

         Full Name
0    Uriah Bridges
1      Paula Small
2      Edward Buck
3  Michael Riordan
4    Jasmine Onque
5     Maruk Fraval
6      Latia Costa
7   Sharlene Terry
8     Jac McKinzie
9   Joseph Martins

[10 rows x 27 columns]

In [15]:
data["Full Name"] = data["FirstName"].str.upper() + " "+data["LastName"]
print(data.head(10))

   EmpID FirstName  LastName  StartDate   ExitDate                    Title  \
0   3427     Uriah   Bridges  20-Sep-19        NaN  Production Technician I
1   3428     Paula     Small  11-Feb-23        NaN  Production Technician I
2   3429    Edward      Buck  10-Dec-18        NaN       Area Sales Manager
3   3430   Michael   Riordan  21-Jun-21        NaN       Area Sales Manager
4   3431   Jasmine     Onque  29-Jun-19        NaN       Area Sales Manager
5   3432     Maruk    Fraval  17-Jan-20        NaN       Area Sales Manager
6   3433     Latia     Costa  06-Apr-22  03-Jul-23       Area Sales Manager
7   3434  Sharlene     Terry  06-Nov-20  29-Jan-23       Area Sales Manager
8   3435       Jac  McKinzie  18-Aug-18        NaN       Area Sales Manager
9   3436    Joseph   Martins  21-Jan-22  29-Jun-23       Area Sales Manager

        Supervisor                        ADEmail BusinessUnit EmployeeStatus  \
0     Peter Oneill    uriah.bridges@bilearner.com         CCDR         Active
1  Renee Mccormick      paula.small@bilearner.com           EW         Active
2   Crystal Walker      edward.buck@bilearner.com           PL         Active
3   Rebekah Wright  michael.riordan@bilearner.com         CCDR         Active
4        Jason Kim    jasmine.onque@bilearner.com          TNS         Active
5     Sheri Campos     maruk.fraval@bilearner.com          BPC         Active
6      Jacob Braun      latia.costa@bilearner.com          WBL         Active
7    Tracy Marquez   sharlene.terry@bilearner.com         CCDR         Active
8    Sharon Becker     jac.mckinzie@bilearner.com          NEL         Active
9   George Jenkins   joseph.martins@bilearner.com          BPC         Active

   ...         DOB State JobFunctionDescription GenderCode LocationCode  \
0  ...  07-10-1969    MA             Accounting     Female        34904
1  ...  30-08-1965    MA                  Labor       Male         6593
2  ...  06-10-1991    MA              Assistant       Male         2330
3  ...  04-04-1998    ND                  Clerk       Male        58782
4  ...  29-08-1969    FL                Laborer     Female        33174
5  ...  03-04-1949    CT                 Driver       Male         6050
6  ...  01-07-1942    CA             Technician     Female        90007
7  ...  07-03-1957    OR               Engineer     Female        97756
8  ...  15-05-1974    TX    Executive Assistant       Male        78789
9  ...  11-11-1949    TX               Engineer       Male        78207

   RaceDesc MaritalDesc Performance Score Current Employee Rating  \
0     White     Widowed       Fully Meets                       4
1  Hispanic     Widowed       Fully Meets                       3
2  Hispanic     Widowed       Fully Meets                       4
3     Other      Single       Fully Meets                       2
4     Other     Married       Fully Meets                       3
5     Black     Married       Fully Meets                       3
6  Hispanic    Divorced           Exceeds                       4
7     White    Divorced       Fully Meets                       2
8     Black     Widowed           Exceeds                       3
9     Asian     Widowed       Fully Meets                       5

         Full Name
0    URIAH Bridges
1      PAULA Small
2      EDWARD Buck
3  MICHAEL Riordan
4    JASMINE Onque
5     MARUK Fraval
6      LATIA Costa
7   SHARLENE Terry
8     JAC McKinzie
9   JOSEPH Martins

[10 rows x 27 columns]

In [17]:

data["Full Name"] = data["FirstName"].str.capitalize() + " "+data["LastName"].str.capitalize()
print(data.head(10))

   EmpID FirstName  LastName  StartDate   ExitDate                    Title  \
0   3427     Uriah   Bridges  20-Sep-19        NaN  Production Technician I
1   3428     Paula     Small  11-Feb-23        NaN  Production Technician I
2   3429    Edward      Buck  10-Dec-18        NaN       Area Sales Manager
3   3430   Michael   Riordan  21-Jun-21        NaN       Area Sales Manager
4   3431   Jasmine     Onque  29-Jun-19        NaN       Area Sales Manager
5   3432     Maruk    Fraval  17-Jan-20        NaN       Area Sales Manager
6   3433     Latia     Costa  06-Apr-22  03-Jul-23       Area Sales Manager
7   3434  Sharlene     Terry  06-Nov-20  29-Jan-23       Area Sales Manager
8   3435       Jac  McKinzie  18-Aug-18        NaN       Area Sales Manager
9   3436    Joseph   Martins  21-Jan-22  29-Jun-23       Area Sales Manager

        Supervisor                        ADEmail BusinessUnit EmployeeStatus  \
0     Peter Oneill    uriah.bridges@bilearner.com         CCDR         Active
1  Renee Mccormick      paula.small@bilearner.com           EW         Active
2   Crystal Walker      edward.buck@bilearner.com           PL         Active
3   Rebekah Wright  michael.riordan@bilearner.com         CCDR         Active
4        Jason Kim    jasmine.onque@bilearner.com          TNS         Active
5     Sheri Campos     maruk.fraval@bilearner.com          BPC         Active
6      Jacob Braun      latia.costa@bilearner.com          WBL         Active
7    Tracy Marquez   sharlene.terry@bilearner.com         CCDR         Active
8    Sharon Becker     jac.mckinzie@bilearner.com          NEL         Active
9   George Jenkins   joseph.martins@bilearner.com          BPC         Active

   ...         DOB State JobFunctionDescription GenderCode LocationCode  \
0  ...  07-10-1969    MA             Accounting     Female        34904
1  ...  30-08-1965    MA                  Labor       Male         6593
2  ...  06-10-1991    MA              Assistant       Male         2330
3  ...  04-04-1998    ND                  Clerk       Male        58782
4  ...  29-08-1969    FL                Laborer     Female        33174
5  ...  03-04-1949    CT                 Driver       Male         6050
6  ...  01-07-1942    CA             Technician     Female        90007
7  ...  07-03-1957    OR               Engineer     Female        97756
8  ...  15-05-1974    TX    Executive Assistant       Male        78789
9  ...  11-11-1949    TX               Engineer       Male        78207

   RaceDesc MaritalDesc Performance Score Current Employee Rating  \
0     White     Widowed       Fully Meets                       4
1  Hispanic     Widowed       Fully Meets                       3
2  Hispanic     Widowed       Fully Meets                       4
3     Other      Single       Fully Meets                       2
4     Other     Married       Fully Meets                       3
5     Black     Married       Fully Meets                       3
6  Hispanic    Divorced           Exceeds                       4
7     White    Divorced       Fully Meets                       2
8     Black     Widowed           Exceeds                       3
9     Asian     Widowed       Fully Meets                       5

         Full Name
0    Uriah Bridges
1      Paula Small
2      Edward Buck
3  Michael Riordan
4    Jasmine Onque
5     Maruk Fraval
6      Latia Costa
7   Sharlene Terry
8     Jac Mckinzie
9   Joseph Martins

[10 rows x 27 columns]

In [4]:
import pandas as pd
data = pd.read_csv("bonus.csv")
# print(data)

data["New_Bonus"] = (data["Salary"]/100)*20
print(data)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team  New_Bonus
0                True             Marketing    19461.6
1                True                   NaN    12386.6
2               False               Finance    26118.0
3                True               Finance    27741.0
4                True       Client Services    20200.8
..                ...                   ...        ...
995             False          Distribution    26496.6
996             False               Finance     8478.4
997             False               Product    19382.8
998             False  Business Development    12100.0
999              True                 Sales    25989.8

[1000 rows x 9 columns]

In [6]:
data = {"Months":["January","Feburay","March","April"]}
a = pd.DataFrame(data)
# print(a)

def extract(value):
    return value[0:3]


a["Short_months"] = a["Months"].map(extract)
print(a)

    Months Short_months
0  January          Jan
1  Feburay          Feb
2    March          Mar
3    April          Apr

In [9]:
import pandas as pd
data = pd.read_csv("employee_data.csv")
print(data.head(10))

   EmpID FirstName  LastName  StartDate   ExitDate                    Title  \
0   3427     Uriah   Bridges  20-Sep-19        NaN  Production Technician I
1   3428     Paula     Small  11-Feb-23        NaN  Production Technician I
2   3429    Edward      Buck  10-Dec-18        NaN       Area Sales Manager
3   3430   Michael   Riordan  21-Jun-21        NaN       Area Sales Manager
4   3431   Jasmine     Onque  29-Jun-19        NaN       Area Sales Manager
5   3432     Maruk    Fraval  17-Jan-20        NaN       Area Sales Manager
6   3433     Latia     Costa  06-Apr-22  03-Jul-23       Area Sales Manager
7   3434  Sharlene     Terry  06-Nov-20  29-Jan-23       Area Sales Manager
8   3435       Jac  McKinzie  18-Aug-18        NaN       Area Sales Manager
9   3436    Joseph   Martins  21-Jan-22  29-Jun-23       Area Sales Manager

        Supervisor                        ADEmail BusinessUnit EmployeeStatus  \
0     Peter Oneill    uriah.bridges@bilearner.com         CCDR         Active
1  Renee Mccormick      paula.small@bilearner.com           EW         Active
2   Crystal Walker      edward.buck@bilearner.com           PL         Active
3   Rebekah Wright  michael.riordan@bilearner.com         CCDR         Active
4        Jason Kim    jasmine.onque@bilearner.com          TNS         Active
5     Sheri Campos     maruk.fraval@bilearner.com          BPC         Active
6      Jacob Braun      latia.costa@bilearner.com          WBL         Active
7    Tracy Marquez   sharlene.terry@bilearner.com         CCDR         Active
8    Sharon Becker     jac.mckinzie@bilearner.com          NEL         Active
9   George Jenkins   joseph.martins@bilearner.com          BPC         Active

   ...              Division         DOB State JobFunctionDescription  \
0  ...  Finance & Accounting  07-10-1969    MA             Accounting
1  ...                Aerial  30-08-1965    MA                  Labor
2  ...         General - Sga  06-10-1991    MA              Assistant
3  ...  Finance & Accounting  04-04-1998    ND                  Clerk
4  ...         General - Con  29-08-1969    FL                Laborer
5  ...      Field Operations  03-04-1949    CT                 Driver
6  ...         General - Eng  01-07-1942    CA             Technician
7  ...             Engineers  07-03-1957    OR               Engineer
8  ...             Executive  15-05-1974    TX    Executive Assistant
9  ...             Engineers  11-11-1949    TX               Engineer

  GenderCode LocationCode  RaceDesc MaritalDesc Performance Score  \
0     Female        34904     White     Widowed       Fully Meets
1       Male         6593  Hispanic     Widowed       Fully Meets
2       Male         2330  Hispanic     Widowed       Fully Meets
3       Male        58782     Other      Single       Fully Meets
4     Female        33174     Other     Married       Fully Meets
5       Male         6050     Black     Married       Fully Meets
6     Female        90007  Hispanic    Divorced           Exceeds
7     Female        97756     White    Divorced       Fully Meets
8       Male        78789     Black     Widowed           Exceeds
9       Male        78207     Asian     Widowed       Fully Meets

  Current Employee Rating
0                       4
1                       3
2                       4
3                       2
4                       3
5                       3
6                       4
7                       2
8                       3
9                       5

[10 rows x 26 columns]

In [10]:
gp = data.groupby("Division").agg({"GenderCode":"count"})
print(gp)

                          GenderCode
Division
Aerial                           196
Billable Consultants              24
Catv                              58
Corp Operations                    2
Engineers                        275
Executive                         43
Field Operations                 789
Fielders                          82
Finance & Accounting              70
General - Con                    509
General - Eng                     86
General - Sga                    117
Isp                               14
People Services                   25
Project Management - Con         178
Project Management - Eng          16
Safety                             9
Sales & Marketing                  9
Shop (Fleet)                      57
Splicing                         110
Technology / It                   26
Underground                       33
Wireless                          33
Wireline Construction            180
Yard (Material Handling)          59

In [13]:
gp = data.groupby(["Division","GenderCode"]).agg({"EmpID":"count"})
print(gp)

                                     EmpID
Division                 GenderCode
Aerial                   Female        120
                         Male           76
Billable Consultants     Female         12
                         Male           12
Catv                     Female         34
                         Male           24
Corp Operations          Male            2
Engineers                Female        146
                         Male          129
Executive                Female         20
                         Male           23
Field Operations         Female        431
                         Male          358
Fielders                 Female         41
                         Male           41
Finance & Accounting     Female         35
                         Male           35
General - Con            Female        296
                         Male          213
General - Eng            Female         47
                         Male           39
General - Sga            Female         70
                         Male           47
Isp                      Female          8
                         Male            6
People Services          Female         16
                         Male            9
Project Management - Con Female        103
                         Male           75
Project Management - Eng Female          8
                         Male            8
Safety                   Female          5
                         Male            4
Sales & Marketing        Female          5
                         Male            4
Shop (Fleet)             Female         35
                         Male           22
Splicing                 Female         54
                         Male           56
Technology / It          Female         18
                         Male            8
Underground              Female         19
                         Male           14
Wireless                 Female         25
                         Male            8
Wireline Construction    Female         99
                         Male           81
Yard (Material Handling) Female         35
                         Male           24

In [16]:
gp1 = data.groupby("State").agg({"Current Employee Rating":"mean"})
print(gp1)

       Current Employee Rating
State
AL                    2.727273
AZ                    3.000000
CA                    2.600000
CO                    3.041667
CT                    3.100000
FL                    3.000000
GA                    2.333333
ID                    3.032258
IN                    2.500000
KY                    2.925926
MA                    2.976235
ME                    3.000000
MT                    1.000000
NC                    3.200000
ND                    1.500000
NH                    2.000000
NV                    4.000000
NY                    3.363636
OH                    1.000000
OR                    2.444444
PA                    3.000000
RI                    3.250000
TN                    2.916667
TX                    2.826923
UT                    3.000000
VA                    4.500000
VT                    3.500000
WA                    2.900000

In [18]:
gp1 = data.groupby("State").agg({"Current Employee Rating":"max"})
print(gp1)

       Current Employee Rating
State
AL                           5
AZ                           5
CA                           5
CO                           5
CT                           5
FL                           3
GA                           3
ID                           5
IN                           5
KY                           5
MA                           5
ME                           4
MT                           1
NC                           4
ND                           2
NH                           2
NV                           4
NY                           5
OH                           1
OR                           5
PA                           3
RI                           5
TN                           5
TX                           5
UT                           4
VA                           5
VT                           5
WA                           5

In [20]:
gp1 = data.groupby("State").agg({"Current Employee Rating":"max","Current Employee Rating":"min"})
print(gp1)

       Current Employee Rating
State
AL                           1
AZ                           1
CA                           1
CO                           1
CT                           1
FL                           3
GA                           2
ID                           1
IN                           1
KY                           1
MA                           1
ME                           2
MT                           1
NC                           2
ND                           1
NH                           2
NV                           4
NY                           1
OH                           1
OR                           1
PA                           3
RI                           2
TN                           1
TX                           1
UT                           2
VA                           4
VT                           2
WA                           1

In [22]:
gp1 = data.groupby("State").agg({"Current Employee Rating":"max","EmpID":"count"})
print(gp1)

       Current Employee Rating  EmpID
State
AL                           5     11
AZ                           5     31
CA                           5     10
CO                           5     24
CT                           5     40
FL                           3      1
GA                           3      3
ID                           5     31
IN                           5     14
KY                           5     27
MA                           5   2651
ME                           4      2
MT                           1      1
NC                           4      5
ND                           2      4
NH                           2      2
NV                           4      1
NY                           5     11
OH                           1      1
OR                           5      9
PA                           3     13
RI                           5      4
TN                           5     24
TX                           5     52
UT                           4      2
VA                           5      2
VT                           5      4
WA                           5     20

In [19]:
gp1 = data.groupby(["State","GenderCode"]).agg({"Current Employee Rating":"mean"})
print(gp1)

                  Current Employee Rating
State GenderCode
AL    Male                       2.727273
AZ    Female                     2.666667
      Male                       3.035714
CA    Female                     2.500000
      Male                       2.666667
CO    Male                       3.041667
CT    Female                     3.227273
      Male                       2.944444
FL    Female                     3.000000
GA    Female                     2.333333
ID    Female                     2.000000
      Male                       3.103448
IN    Female                     4.500000
      Male                       2.166667
KY    Female                     2.772727
      Male                       3.600000
MA    Female                     2.996134
      Male                       2.948135
ME    Male                       3.000000
MT    Female                     1.000000
NC    Female                     3.000000
      Male                       3.333333
ND    Female                     1.000000
      Male                       1.666667
NH    Male                       2.000000
NV    Male                       4.000000
NY    Female                     4.000000
      Male                       3.300000
OH    Female                     1.000000
OR    Female                     1.600000
      Male                       3.500000
PA    Female                     3.000000
RI    Female                     3.250000
TN    Male                       2.916667
TX    Female                     2.550000
      Male                       3.000000
UT    Male                       3.000000
VA    Female                     4.500000
VT    Female                     3.500000
WA    Female                     3.000000
      Male                       2.333333

In [2]:
import pandas as pd
data1 = {"Emp Id" : ["E01","E02","E03","E04","E05","E06"],
        "Name":["Ram","Shyam","Rahul","Bishal","Ravi","kundan"],
        "Age":[34,56,23,21,22,25]}
data2 = {"Emp Id": ["E01","E02","E03","E04","E05","E06"],
        "Salary" : [45000,56000,34000,47000,67000,69000]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)

  Emp Id    Name  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04  Bishal   21
4    E05    Ravi   22
5    E06  kundan   25

  Emp Id  Salary
0    E01   45000
1    E02   56000
2    E03   34000
3    E04   47000
4    E05   67000
5    E06   69000

In [4]:
print(pd.merge(df1,df2,on = "Emp Id"))

  Emp Id    Name  Age  Salary
0    E01     Ram   34   45000
1    E02   Shyam   56   56000
2    E03   Rahul   23   34000
3    E04  Bishal   21   47000
4    E05    Ravi   22   67000
5    E06  kundan   25   69000

In [7]:
data1 = {"Emp Id" : ["E01","E02","E03","E04","E05","E06"],
        "Name":["Ram","Shyam","Rahul","Bishal","Ravi","kundan"],
        "Age":[34,56,23,21,22,25]}
data2 = {"Emp Id": ["E01","E06","E03","E08","E05","E07"],
        "Salary" : [45000,56000,34000,47000,67000,69000]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(pd.merge(df1,df2,on = "Emp Id"))

  Emp Id    Name  Age  Salary
0    E01     Ram   34   45000
1    E03   Rahul   23   34000
2    E05    Ravi   22   67000
3    E06  kundan   25   56000

In [8]:
print(pd.merge(df1,df2,on = "Emp Id",how = "inner"))

  Emp Id    Name  Age  Salary
0    E01     Ram   34   45000
1    E03   Rahul   23   34000
2    E05    Ravi   22   67000
3    E06  kundan   25   56000

In [10]:
print(pd.merge(left = df1,right = df2,on = "Emp Id",how = "left"))

  Emp Id    Name  Age   Salary
0    E01     Ram   34  45000.0
1    E02   Shyam   56      NaN
2    E03   Rahul   23  34000.0
3    E04  Bishal   21      NaN
4    E05    Ravi   22  67000.0
5    E06  kundan   25  56000.0

In [11]:
print(pd.merge(left = df1,right = df2,on = "Emp Id",how = "right"))

  Emp Id    Name   Age  Salary
0    E01     Ram  34.0   45000
1    E06  kundan  25.0   56000
2    E03   Rahul  23.0   34000
3    E08     NaN   NaN   47000
4    E05    Ravi  22.0   67000
5    E07     NaN   NaN   69000

In [16]:
# data1 = {"Emp Id" : ["E01","E02","E03","E04","E05","E06"],
#         "Name":["Ram","Shyam","Rahul","Bishal","Ravi","kundan"],
#         "Age":[34,56,23,21,22,25]}
# data2 = {"Emp Id" : ["E07","E08","E09","E10","E11","E12"],
#         "Name":["john","Amit","Babu bhai","Pandit","RAm","siya"],
#         "Age":[34,56,23,21,22,25]}
# df1 = pd.DataFrame(data1)
# df2 = pd.DataFrame(data2)

In [19]:
print(pd.concat([df1,df2]))

  Emp Id       Name  Age
0    E01        Ram   34
1    E02      Shyam   56
2    E03      Rahul   23
3    E04     Bishal   21
4    E05       Ravi   22
5    E06     kundan   25
0    E07       john   34
1    E08       Amit   56
2    E09  Babu bhai   23
3    E10     Pandit   21
4    E11        RAm   22
5    E12       siya   25

In [27]:
import pandas as pd

dict = {"Fruits":["Mango","Apples","Banana","Papaya"],
       "Price" : [100,150,50,30],
       "Quantity" : [15,10,10,5]}

df1 = pd.DataFrame(dict)
print(df)

df2 = df1.copy()

df2.loc[0,"Price"] = 120
df2.loc[1,"Price"] = 175
df2.loc[3,"Price"] = 30

df2.loc[0,"Quantity"] = 12
df2.loc[1,"Quantity"] = 15
df2.loc[3,"Quantity"] = 7




print(df2)

   Fruits  Price  Quantity
0   Mango    100        15
1  Apples    150        10
2  Banana     50        10
3  Papaya     30         5
   Fruits  Price  Quantity
0   Mango    120        12
1  Apples    175        15
2  Banana     50        10
3  Papaya     30         7

In [28]:
print(df1.compare(df2))

   Price        Quantity
    self  other     self other
0  100.0  120.0     15.0  12.0
1  150.0  175.0     10.0  15.0
3    NaN    NaN      5.0   7.0

In [29]:
print(df1.compare(df2,align_axis=0))

         Price  Quantity
0 self   100.0      15.0
  other  120.0      12.0
1 self   150.0      10.0
  other  175.0      15.0
3 self     NaN       5.0
  other    NaN       7.0

In [30]:
print(df1.compare(df2,keep_equal=True))

  Price       Quantity
   self other     self other
0   100   120       15    12
1   150   175       10    15
3    30    30        5     7

In [31]:
print(df1.compare(df2,keep_shape=True))

  Fruits        Price        Quantity
    self other   self  other     self other
0    NaN   NaN  100.0  120.0     15.0  12.0
1    NaN   NaN  150.0  175.0     10.0  15.0
2    NaN   NaN    NaN    NaN      NaN   NaN
3    NaN   NaN    NaN    NaN      5.0   7.0

In [32]:
print(df1.compare(df2,keep_shape=False))

   Price        Quantity
    self  other     self other
0  100.0  120.0     15.0  12.0
1  150.0  175.0     10.0  15.0
3    NaN    NaN      5.0   7.0

In [ ]:
# Pandas :- Pivoting and Melting Dataframes

In [44]:
import pandas as pd
dict = {"keys":["k1","k2","k1","k2"],
        "Name": ["john","Ben","David","Peter"],
        "Houses":["red","Blue","Green","red"],
        "Grades" : ["3rd","8th","9th","8th"]
       }
df = pd.DataFrame(dict)
print(df)

  keys   Name Houses Grades
0   k1   john    red    3rd
1   k2    Ben   Blue    8th
2   k1  David  Green    9th
3   k2  Peter    red    8th

In [46]:
print(df.pivot(index="keys", columns="Name", values= ["Houses","Grades"]))

     Houses                   Grades
Name    Ben  David Peter john    Ben David Peter john
keys
k1      NaN  Green   NaN  red    NaN   9th   NaN  3rd
k2     Blue    NaN   red  NaN    8th   NaN   8th  NaN

In [51]:
#  melting
dict = {"Name": ["john","Ben","David","Peter"],
        "Houses":["red","Blue","Green","red"],
        "Grades" : ["3rd","8th","9th","8th"]
       }

df = pd.DataFrame(dict)
print(df)

print (pd.melt(df,id_vars =["Name"],value_vars = ["Houses"]))

    Name Houses Grades
0   john    red    3rd
1    Ben   Blue    8th
2  David  Green    9th
3  Peter    red    8th
    Name variable  value
0   john   Houses    red
1    Ben   Houses   Blue
2  David   Houses  Green
3  Peter   Houses    red

In [52]:
print (pd.melt(df,id_vars =["Name"],value_vars = ["Houses","Grades"]))

    Name variable  value
0   john   Houses    red
1    Ben   Houses   Blue
2  David   Houses  Green
3  Peter   Houses    red
4   john   Grades    3rd
5    Ben   Grades    8th
6  David   Grades    9th
7  Peter   Grades    8th

In [53]:
print (pd.melt(df,id_vars =["Name"],value_vars = ["Houses","Grades"],var_name = "Houses&Gardes", value_name = "Values1"))

    Name Houses&Gardes Values1
0   john        Houses     red
1    Ben        Houses    Blue
2  David        Houses   Green
3  Peter        Houses     red
4   john        Grades     3rd
5    Ben        Grades     8th
6  David        Grades     9th
7  Peter        Grades     8th